## Plan結果 (datadog-sandbox)

**Plan: 1 to add, 0 to change, 1 to destroy.**

### :warning: リソース変更・削除が発生します :warning:

```diff

@@ Delete @@
- google_storage_bucket.test_bucket_datadog_japan
```




<details><summary>リソースごとの変更内容の要約はこちら</summary>

```diff

@@ Create @@
+ google_storage_bucket.static-site
@@ Delete @@
- google_storage_bucket.test_bucket_datadog_japan

```

</details>


<details><summary>planの差分詳細はこちら</summary>

```hcl

  # google_storage_bucket.static-site will be created
  + resource "google_storage_bucket" "static-site" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "image-store.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "HEAD",
              + "PUT",
              + "POST",
              + "DELETE",
            ]
          + origin          = [
              + "http://image-store.com",
            ]
          + response_header = [
              + "*",
            ]
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "404.html"
        }
    }

  # google_storage_bucket.test_bucket_datadog_japan will be destroyed
  # (because google_storage_bucket.test_bucket_datadog_japan is not in configuration)
  - resource "google_storage_bucket" "test_bucket_datadog_japan" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "test-bucket-for-terraform-example-6789" -> null
      - labels                      = {} -> null
      - location                    = "US" -> null
      - name                        = "test-bucket-for-terraform-example-6789" -> null
      - project                     = "datadog-sandbox" -> null
      - project_number              = 958371799887 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-for-terraform-example-6789" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://test-bucket-for-terraform-example-6789" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - retention_duration_seconds = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>







[GitHub Actions上の実行詳細へのリンク](https://github.com/dd-japan/ctf-terraform/actions/runs/15431355124)

<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":9,"Program":"tfcmt","SHA1":"62cd2170f7e4228fb24b3073e74d94a2aeaead58","Target":"datadog-sandbox","Vars":{},"WorkflowName":"terraform plan"} -->